app/Repository/AdvertsRepository.php

    public function getAdvertsLists(string $role = 'home')
    {
        try {
            $query = AdvertsModel::query();
            if ($role == 'home') {
                $data = $query->where('display', 'yes')->get()->groupBy('position');
---
SELECT * FROM `adverts` WHERE `display` = 'yes'