app/Repository/ArticleTagRepository.php

    public function addArticleTag(array $params, ArticlesModel $article):InfoReturn
    {
        try {
            $tags = TagsModel::query()->pluck('id')->toArray();
            $validator = \Validator::make(
                $params,
                ['tag_ids' => 'required|array'],
                [
                    'tag_ids.required' => '标签不能为空',
                    'tag_ids.array' => '标签参数必须为数组'
                ]
            );
            $validator->after(function () use ($validator, $tags, $params) {
                foreach ($params['tag_ids'] as $item) {
                    if (!in_array($item, $tags, true)) {
                        $validator->errors()->add('tag_ids', '该标签不存在');
                        continue;
                    }
                }
            });
            if ($validator->fails()) {
                throw new \Exception($validator->errors()->first());
            }
            $insert = [];
            foreach ($params['tag_ids'] as $val) {
                $insert[] = [
                    'article_id' => $article->id,
                    'tag_id' => $val
                ];
            }
            $count = ArticleTagModel::query()->insert($insert);
---
SELECT `id` FROM `tags`
INSERT into `article_tag` (`article_id`, `tag_id`) values ('1', '1')

    public function getArticleTags(int $id):InfoReturn
    {
        try {
            $article  = ArticlesModel::query()->find($id);
            if (null === $article) throw new \Exception('该文章不存在');
            /*获取该文章的所有tag*/
            $articleTags = ArticleTagModel::query()->where('article_id', $article->id)->get();
---
SELECT * FROM `articles` WHERE `articles`.`id` = '1' LIMIT 1
SELECT * FROM `article_tag` WHERE `article_id` = '1'

    public function updateArticleTags(ArticlesModel $article, array $tags):bool
    {
        /*删除原来的标签*/
        $res = ArticleTagModel::query()->where('article_id', $article->id)->delete();
        $insert = [];
        foreach ($tags as $tag_id) {
            $insert[] = ['article_id' => $article->id, 'tag_id' => $tag_id];
        }
        $rs = count($tags) == ArticleTagModel::query()->insert($insert);
---
DELETE FROM `article_tag` WHERE `article_id` = '1'
INSERT into `article_tag` (`article_id`, `tag_id`) values ('9', '2'), ('9', '5')