app/Repository/ArticlesRepository.php

SELECT * FROM `articles` ORDER BY case when pull_top = 'yes' then 4 when pull_top != 'yes' then 3 
            when article_support = 'yes' then 1 else 0 end DESC, created_at DESC LIMIT 8 offset 0
SELECT count(*) as aggregate FROM `articles`
SELECT * FROM `article_tag` WHERE `article_id` in ('9', '8', '6', '5', '4', '3', '2', '7')
SELECT * FROM `tags` WHERE `tags`.`id` in ('1', '2', '5', '7', '8')
---
    public function articleList(array $params, int $paginate = 8)
    {
        $query = ArticlesModel::query();

       /*按标签查询*/
        if ($params['tag_id'] ?? null) {
            $articleIds = ArticleTagModel::query()->where('tag_id', $params['tag_id'])->pluck('article_id');
            $query->whereIn('id', $articleIds);
        }

        /*按内容搜索*/
        if (!empty($params['query'])) {
            $query->where('title', 'like', '%'. $params['query']. '%')
                ->orWhere('key_words', 'like', '%'. $params['query']. '%')
                ->orWhere('content', 'like', '%'. $params['query']. '%');
        }

        /*置顶排序优先*/
        $query->orderByRaw("case when pull_top = 'yes' then 4 when pull_top != 'yes' then 3
            when article_support = 'yes' then 1 else 0 end desc, created_at desc");
        $data = $query->paginate($paginate);
        $ids = collect($data->items())->pluck('id');
        /*查出所有文章的标签*/
        $tags = ArticleTagModel::with('tag')->whereIn('article_id', $ids)->get();

SELECT * FROM `articles` ORDER BY case when pull_top = 'yes' then 4 else 3 end DESC, `click_number` DESC, case when article_support = 'yes' then 3 else 2 end DESC, created_at DESC LIMIT 5
---
    public function getHotArticle():InfoReturn
    {
        try {
            $query = ArticlesModel::query();
            $query->orderByRaw("case when pull_top = 'yes' then 4 else 3 end desc");
            $query->orderBy('click_number', 'desc');
            $query->orderByRaw("case when article_support = 'yes' then 3 else 2 end desc, created_at desc");
            $list = $query->limit(5)->get();

SELECT * FROM `comments` WHERE `comments`.`article_id` in ('9') ORDER BY `created_at` DESC
---
    public function articleDetail(int $id):InfoReturn
    {
        $query = ArticlesModel::query();
        try {
            $data = $query->with(['comments' => function ($query) {
                $query->orderBy('created_at', 'desc');
            }])->findOrFail($id);

INSERT into `articles` (`title`, `content`, `render`, `pull_top`, `status`, `article_support`, `key_words`, `image`, `updated_at`, `created_at`) values ('默认工具栏按钮全部开启, 传入自定义对象', '![php.jpg](/uploads/20180910/153654987548.jpeg)', '<p><img src=\"/uploads/20180910/153654987548.jpeg\" alt=\"php.jpg\" /></p>\n', 'yes', 'public', 'yes', 'vue', '/uploads/20180910/153654989093.png', '2018-09-10 11:24:50', '2018-09-10 11:24:50')
---
    public function createArticle(array $params):InfoReturn
    {
        $rtn = $this->checkDataForCreateAndUpdate($params);
        if (!$rtn->getStatus()) {
            return $rtn;
        }
        $data = ArticlesModel::query()->create($params);

SELECT * FROM `articles` WHERE `articles`.`id` = '1' LIMIT 1
UPDATE `articles` set `content` = '\n![图片](http://rose-blog.oss-cn-shenzhen.aliyuncs.com/image/153656102393.png)', `render` = '<p><img src=\"http://rose-blog.oss-cn-shenzhen.aliyuncs.com/image/153656102393.png\" alt=\"图片\"></p>\n', `image` = 'http://rose-blog.oss-cn-shenzhen.aliyuncs.com/image/153656113368.png', `updated_at` = '2018-09-10 14:32:13' WHERE `id` = '9'
---
    public function updateArticle(int $articleId, array $params, array $tags):InfoReturn
    {
        try {
            /*数据验证*/
            $rtn = $this->checkDataForCreateAndUpdate($params);
            if (!$rtn->getStatus()) {
                return $rtn;
            }
            \DB::beginTransaction();
            $articlesModel = ArticlesModel::query()->findOrFail($articleId);
            if (!$rs = $articlesModel->update($params)) throw new \Exception('修改失败');