app/Repository/FriendlyLinkRepository.php

    public function getAll(int $paginate = null)
    {
        $query =  FriendlyLinksModel::query();
        return $paginate ? $query->paginate($paginate) : $query->get();
---
SELECT * FROM `friendly_links`