app/Repository/TagsRepository.php

    public function tagsList(int $paginate = null)
    {
        $query = TagsModel::query();
        return $paginate ? $query->paginate($paginate) : $query->get();
---
SELECT * FROM `tags` LIMIT 8 offset 0
SELECT count(*) as aggregate FROM `tags`

    public function addTag(array $params):InfoReturn
    {
        /*数据校验*/
        $check = $this->checkData($params);
        if (!$check->getStatus()) {
            return $check;
        }
        $img_path = $params['img_path'];
        /*进行缩略图上传*/
        $upload = new FileUploadRepository();
        $rtn = $upload->uploadForBase64($img_path);
        if (!$rtn->getStatus()) {
            return $rtn;
        }
        /*重新组织数据*/
        $params['img_path'] = $rtn->getData()['filePath'];
        $tag = TagsModel::query()->create($params);
---
INSERT into `tags` (`name`, `description`, `img_path`, `updated_at`, `created_at`) values ('vue', '最好用的前端框架，没有之一', '/uploads/20180910/153654986054.png', '2018-09-10 11:24:21', '2018-09-10 11:24:21')