app/Repository/UserRepository.php

SELECT * FROM `users` WHERE `name` = 'admin' LIMIT 1
---
    public function postLogin(array $params):InfoReturn
    {
        $rtn = new InfoReturn();
        /*数据验证*/
        $validator = \Validator::make($params, [
            'name' => 'required',
            'password' => 'required'
        ], [
            'name.*' => '登陆名不能为空',
            'password' => '登陆密码不能为空'
        ]);
        if ($validator->fails()) {
            return $rtn->setAll([
                'status' => false,
                'info' => $validator->errors()->first(),
                'data' => ''
            ]);
        }
        try {
            /*验证用户名*/
            if (null == UsersModel::query()->where('name', $params['name'])->first()) {