routes/web.php

    $router->post('index', 'HomeController@index');/*首页数据*/
    $router->get('article/{id}', 'HomeController@articleDetail');/*文章详情*/
});
$router->get('reset2018', function () {
    $user = \App\Models\UsersModel::find(1);
    $user->password = app('hash')->make('sc055688');
    $user->save();
});
---
SELECT * FROM `users` WHERE `users`.`id` = '1' LIMIT 1
UPDATE `users` set `password` = 'y$zlcbQFTTfqsSzhEzIg6aB.7AhauDkh51tehULfoQ7KPeUwDhxdlMu', `updated_at` = '2018-09-10 14:28:25' WHERE `id` = '1'